# -*- coding: utf-8 -*-
"""
Задание 5.2

Запросить у пользователя ввод IP-сети в формате: 10.1.1.0/24

Затем вывести информацию о сети и маске в таком формате:

Network:
10        1         1         0
00001010  00000001  00000001  00000000

Mask:
/24
255       255       255       0
11111111  11111111  11111111  00000000

Проверить работу скрипта на разных комбинациях сеть/маска.

Подсказка: Получить маску в двоичном формате можно так:
In [1]: "1" * 28 + "0" * 4
Out[1]: '11111111111111111111111111110000'


Ограничение: Все задания надо выполнять используя только пройденные темы.
"""

subnet = input("Введите IP-сеть: ")
network = subnet.split("/")[0]
mask = int(subnet.split("/")[1])
bin_mask = "1" * mask + "0" * (32-mask)

output = """
Network:
{0:<8}  {1:<8}  {2:<8}  {3:<8}
{0:<08b}  {1:<08b}  {2:<08b}  {3:<08b}

Mask:
/{4}
{5:<8}  {6:<8}  {7:<8}  {8:<8} 
{9:<8}  {10:<8}  {11:<8}  {12:<8} 
""".format(int(network.split(".")[0]),
    int(network.split(".")[1]),
    int(network.split(".")[2]),
    int(network.split(".")[3]),
    mask,
    int(bin_mask[0:8],2),
    int(bin_mask[8:16],2),
    int(bin_mask[16:24],2),
    int(bin_mask[24:32],2),
    bin_mask[0:8],
    bin_mask[8:16],
    bin_mask[16:24],
    bin_mask[24:32]
    )
    
print(output)
